fduignan/stm32l011_nucleo_RTC_Wakeup/stm32l011.h
// stm32l011 low level header file
// No guarantees or claims of suitability,reliability or safety of any kind are implied or given
// All the values below were taken from the STM32F030xx reference manual (RM0377)
// Also include macros for enabling and disabling global interrupts
// Written by Frank Duignan
// stm32f011.h
// Latest version of this file can be found at http://eleceng.dit.ie/frank/arm
// Changelog
// First written: 27/07/16

#include <stdint.h>
#define BIT0 (1 << 0)
#define BIT1 (1 << 1)
#define BIT2 (1 << 2)
#define BIT3 (1 << 3)
#define BIT4 (1 << 4)
#define BIT5 (1 << 5)
#define BIT6 (1 << 6)
#define BIT7 (1 << 7)
#define BIT8 (1 << 8)
#define BIT9 (1 << 9)
#define BIT10 (1 << 10)
#define BIT11 (1 << 11)
#define BIT12 (1 << 12)
#define BIT13 (1 << 13)
#define BIT14 (1 << 14)
#define BIT15 (1 << 15)
#define BIT16 (1 << 16)
#define BIT17 (1 << 17)
#define BIT18 (1 << 18)
#define BIT19 (1 << 19)
#define BIT20 (1 << 20)
#define BIT21 (1 << 21)
#define BIT22 (1 << 22)
#define BIT23 (1 << 23)
#define BIT24 (1 << 24)
#define BIT25 (1 << 25)
#define BIT26 (1 << 26)
#define BIT27 (1 << 27)
#define BIT28 (1 << 28)
#define BIT29 (1 << 29)
#define BIT30 (1 << 30)
#define BIT31 (1 << 31)

// Macros to reduce typing later on
#define  REGISTER_32(ADDRESS) (*((volatile uint32_t *)(ADDRESS)))
#define  REGISTER_16(ADDRESS) (*((volatile uint16_t *)(ADDRESS)))
#define  REGISTER_8(ADDRESS) (*((volatile uint8_t *)(ADDRESS)))

// Macros to enable/disable global interrupts
#define enable_interrupts() asm(" cpsie i ")
#define disable_interrupts() asm(" cpsid i ")
#define cpu_sleep() asm(" wfi ")

// Boundary addresses for peripherals
#define GPIOH_BASE	0x50001c00
#define GPIOE_BASE	0x50001000
#define GPIOD_BASE	0x50000c00
#define GPIOC_BASE	0x50000800
#define GPIOB_BASE	0x50000400
#define GPIOA_BASE	0x50000000
#define AES_BASE        0x40026000
#define CRC_BASE	0x40023000
#define FLASH_BASE	0x40022000
#define RCC_BASE	0x40021000
#define DMA_BASE	0x40020000
#define DBGMCU_BASE	0x40015800
#define USART1_BASE	0x40013800
#define SPI1_BASE	0x40013000
#define ADC_BASE	0x40012400
#define FIREWALL_BASE	0x40011c00
#define TIM22_BASE	0x40011400
#define TIM21_BASE	0x40010800
#define EXTI_BASE	0x40010400
#define SYSCFG_BASE	0x40010000
#define LPTIM1_BASE	0x40007c00
#define I2C3_BASE	0x40007800
#define PWR_BASE	0x40007000
#define I2C2_BASE	0x40005800
#define I2C1_BASE	0x40005400
#define USART5_BASE	0x40005000
#define USART4_BASE	0x40004c00
#define LPUART_BASE	0x40004800
#define USART2_BASE	0x40004400
#define SPI2_BASE	0x40003800
#define IWDG_BASE	0x40003000
#define WWDG_BASE	0x40002c00
#define RTC_BASE	0x40002800
#define TIM7_BASE	0x40001400
#define TIM6_BASE	0x40001000
#define TIM3_BASE	0x40000400
#define TIM2_BASE	0x40000000

// GPIO registers 
// PORT A
#define GPIOA_MODER	REGISTER_32(GPIOA_BASE + 0)
#define GPIOA_OTYPER	REGISTER_32(GPIOA_BASE + 4)
#define GPIOA_OSPEEDR	REGISTER_32(GPIOA_BASE + 8)
#define GPIOA_PUPDR	REGISTER_32(GPIOA_BASE + 0x0c)
#define GPIOA_IDR	REGISTER_32(GPIOA_BASE + 0x10)
#define GPIOA_ODR	REGISTER_32(GPIOA_BASE + 0x14)
#define GPIOA_BSRR	REGISTER_32(GPIOA_BASE + 0x18)
#define GPIOA_LCKR	REGISTER_32(GPIOA_BASE + 0x1c)
#define GPIOA_AFRL	REGISTER_32(GPIOA_BASE + 0x20)
#define GPIOA_AFRH	REGISTER_32(GPIOA_BASE + 0x24)
#define GPIOA_BRR	REGISTER_32(GPIOA_BASE + 0x28)

// PORT B
#define GPIOB_MODER	REGISTER_32(GPIOB_BASE + 0)
#define GPIOB_OTYPER	REGISTER_32(GPIOB_BASE + 4)
#define GPIOB_OSPEEDR	REGISTER_32(GPIOB_BASE + 8)
#define GPIOB_PUPDR	REGISTER_32(GPIOB_BASE + 0x0c)
#define GPIOB_IDR	REGISTER_32(GPIOB_BASE + 0x10)
#define GPIOB_ODR	REGISTER_32(GPIOB_BASE + 0x14)
#define GPIOB_BSRR	REGISTER_32(GPIOB_BASE + 0x18)
#define GPIOB_LCKR	REGISTER_32(GPIOB_BASE + 0x1c)
#define GPIOB_AFRL	REGISTER_32(GPIOB_BASE + 0x20)
#define GPIOB_AFRH	REGISTER_32(GPIOB_BASE + 0x24)
#define GPIOB_BRR	REGISTER_32(GPIOB_BASE + 0x28)

// PORT C
#define GPIOC_MODER	REGISTER_32(GPIOC_BASE + 0)
#define GPIOC_OTYPER	REGISTER_32(GPIOC_BASE + 4)
#define GPIOC_OSPEEDR	REGISTER_32(GPIOC_BASE + 8)
#define GPIOC_PUPDR	REGISTER_32(GPIOC_BASE + 0x0c)
#define GPIOC_IDR	REGISTER_32(GPIOC_BASE + 0x10)
#define GPIOC_ODR	REGISTER_32(GPIOC_BASE + 0x14)
#define GPIOC_BSRR	REGISTER_32(GPIOC_BASE + 0x18)
#define GPIOC_LCKR	REGISTER_32(GPIOC_BASE + 0x1c)
#define GPIOC_AFRL	REGISTER_32(GPIOC_BASE + 0x20)
#define GPIOC_AFRH	REGISTER_32(GPIOC_BASE + 0x24)
#define GPIOC_BRR	REGISTER_32(GPIOC_BASE + 0x28)

// PORT D
#define GPIOD_MODER	REGISTER_32(GPIOD_BASE + 0)
#define GPIOD_OTYPER	REGISTER_32(GPIOD_BASE + 4)
#define GPIOD_OSPEEDR	REGISTER_32(GPIOD_BASE + 8)
#define GPIOD_PUPDR	REGISTER_32(GPIOD_BASE + 0x0c)
#define GPIOD_IDR	REGISTER_32(GPIOD_BASE + 0x10)
#define GPIOD_ODR	REGISTER_32(GPIOD_BASE + 0x14)
#define GPIOD_BSRR	REGISTER_32(GPIOD_BASE + 0x18)
#define GPIOD_LCKR	REGISTER_32(GPIOD_BASE + 0x1c)
#define GPIOD_AFRL	REGISTER_32(GPIOD_BASE + 0x20)
#define GPIOD_AFRH	REGISTER_32(GPIOD_BASE + 0x24)
#define GPIOD_BRR	REGISTER_32(GPIOD_BASE + 0x28)

// PORT E
#define GPIOE_MODER	REGISTER_32(GPIOE_BASE + 0)
#define GPIOE_OTYPER	REGISTER_32(GPIOE_BASE + 4)
#define GPIOE_OSPEEDR	REGISTER_32(GPIOE_BASE + 8)
#define GPIOE_PUPDR	REGISTER_32(GPIOE_BASE + 0x0c)
#define GPIOE_IDR	REGISTER_32(GPIOE_BASE + 0x10)
#define GPIOE_ODR	REGISTER_32(GPIOE_BASE + 0x14)
#define GPIOE_BSRR	REGISTER_32(GPIOE_BASE + 0x18)
#define GPIOE_LCKR	REGISTER_32(GPIOE_BASE + 0x1c)
#define GPIOE_AFRL	REGISTER_32(GPIOE_BASE + 0x20)
#define GPIOE_AFRH	REGISTER_32(GPIOE_BASE + 0x24)
#define GPIOE_BRR	REGISTER_32(GPIOE_BASE + 0x28)


// PORT H
#define GPIOH_MODER	REGISTER_32(GPIOH_BASE + 0)
#define GPIOH_OTYPER	REGISTER_32(GPIOH_BASE + 4)
#define GPIOH_OSPEEDR	REGISTER_32(GPIOH_BASE + 8)
#define GPIOH_PUPDR	REGISTER_32(GPIOH_BASE + 0x0c)
#define GPIOH_IDR	REGISTER_32(GPIOH_BASE + 0x10)
#define GPIOH_ODR	REGISTER_32(GPIOH_BASE + 0x14)
#define GPIOH_BSRR	REGISTER_32(GPIOH_BASE + 0x18)
#define GPIOH_LCKR	REGISTER_32(GPIOH_BASE + 0x1c)
#define GPIOH_AFRL	REGISTER_32(GPIOH_BASE + 0x20)
#define GPIOH_AFRH	REGISTER_32(GPIOH_BASE + 0x24)
#define GPIOH_BRR	REGISTER_32(GPIOH_BASE + 0x28)


// AES
#define AES_CR  	REGISTER_32(AES_BASE + 0x0000)
#define AES_SR  	REGISTER_32(AES_BASE + 0x0004)
#define AES_DINR  	REGISTER_32(AES_BASE + 0x0008)
#define AES_DOUTR  	REGISTER_32(AES_BASE + 0x000c)
#define AES_KEYR0  	REGISTER_32(AES_BASE + 0x0010)
#define AES_KEYR1  	REGISTER_32(AES_BASE + 0x0014)
#define AES_KEYR2  	REGISTER_32(AES_BASE + 0x0018)
#define AES_KEYR3  	REGISTER_32(AES_BASE + 0x001c)
#define AES_IVR0  	REGISTER_32(AES_BASE + 0x0020)
#define AES_IVR1  	REGISTER_32(AES_BASE + 0x0024)
#define AES_IVR2  	REGISTER_32(AES_BASE + 0x0028)
#define AES_IVR3  	REGISTER_32(AES_BASE + 0x002c)



// CRC
#define CRC_DR 		REGISTER_32(CRC_BASE + 0)
#define CRC_IDR 	REGISTER_32(CRC_BASE + 4)
#define CRC_CR 		REGISTER_32(CRC_BASE + 8)
#define CRC_INIT 	REGISTER_32(CRC_BASE + 0x10)
#define CRC_POL 	REGISTER_32(CRC_BASE + 0x14)

// FLASH
#define FLASH_ACR	REGISTER_32(FLASH_BASE + 0)
#define FLASH_PECR	REGISTER_32(FLASH_BASE + 4)
#define FLASH_PDKEYR	REGISTER_32(FLASH_BASE + 8)
#define FLASH_PKEYR	REGISTER_32(FLASH_BASE + 0x0c)
#define FLASH_PRGKEYR	REGISTER_32(FLASH_BASE + 0x10)
#define FLASH_OPTKEYR	REGISTER_32(FLASH_BASE + 0x14)
#define FLASH_SR	REGISTER_32(FLASH_BASE + 0x18)
#define FLASH_OPTR	REGISTER_32(FLASH_BASE + 0x1c)
#define FLASH_WRPROT1	REGISTER_32(FLASH_BASE + 0x20)
#define FLASH_WRPROT2	REGISTER_32(FLASH_BASE + 0x80)

// RCC registers
#define RCC_CR 		REGISTER_32(RCC_BASE + 0)
#define RCC_ICSCR	REGISTER_32(RCC_BASE + 4)
#define RCC_CFGR	REGISTER_32(RCC_BASE + 0x0c)
#define RCC_CIER	REGISTER_32(RCC_BASE + 0x10)	
#define RCC_CIFR	REGISTER_32(RCC_BASE + 0x14)	
#define RCC_CICR	REGISTER_32(RCC_BASE + 0x18)
#define RCC_IOPRSTR	REGISTER_32(RCC_BASE + 0x1c)
#define RCC_AHBRSTR	REGISTER_32(RCC_BASE + 0x20)
#define RCC_APB2RSTR	REGISTER_32(RCC_BASE + 0x24)
#define RCC_APB1RSTR	REGISTER_32(RCC_BASE + 0x28)
#define RCC_IOPENR	REGISTER_32(RCC_BASE + 0x2c)
#define RCC_AHBENR	REGISTER_32(RCC_BASE + 0x30)
#define RCC_APB2ENR	REGISTER_32(RCC_BASE + 0x34)
#define RCC_APB1ENR	REGISTER_32(RCC_BASE + 0x38)
#define RCC_IOPSMEM	REGISTER_32(RCC_BASE + 0x3c)
#define RCC_AHBSMENR	REGISTER_32(RCC_BASE + 0x40)
#define RCC_APB2SMENR	REGISTER_32(RCC_BASE + 0x44)
#define RCC_APB1SMENR	REGISTER_32(RCC_BASE + 0x48)
#define RCC_CCIPR	REGISTER_32(RCC_BASE + 0x4c)
#define RCC_CSR 	REGISTER_32(RCC_BASE + 0x50)

// DMA
#define DMA_ISR 	REGISTER_32(DMA_BASE + 0)
#define DMA_IFCR 	REGISTER_32(DMA_BASE + 4)
#define DMA_CCR1 	REGISTER_32(DMA_BASE + 8)
#define DMA_CNDTR1	REGISTER_32(DMA_BASE + 0x0c)
#define DMA_CPAR1	REGISTER_32(DMA_BASE + 0x10)
#define DMA_CMAR1	REGISTER_32(DMA_BASE + 0x14)
#define DMA_CCR2	REGISTER_32(DMA_BASE + 0x1c)
#define DMA_CNDTR2	REGISTER_32(DMA_BASE + 0x20)
#define DMA_CPAR2	REGISTER_32(DMA_BASE + 0x24)
#define DMA_CMAR2	REGISTER_32(DMA_BASE + 0x28)
#define DMA_CCR3	REGISTER_32(DMA_BASE + 0x30)
#define DMA_CNDTR3	REGISTER_32(DMA_BASE + 0x34)
#define DMA_CPAR3	REGISTER_32(DMA_BASE + 0x38)
#define DMA_CMAR3	REGISTER_32(DMA_BASE + 0x3c)
#define DMA_CCR4	REGISTER_32(DMA_BASE + 0x44)
#define DMA_CNDTR4	REGISTER_32(DMA_BASE + 0x48)
#define DMA_CPAR4	REGISTER_32(DMA_BASE + 0x4c)
#define DMA_CMAR4	REGISTER_32(DMA_BASE + 0x50)
#define DMA_CCR5	REGISTER_32(DMA_BASE + 0x58)
#define DMA_CNDTR5	REGISTER_32(DMA_BASE + 0x5c)
#define DMA_CPAR5	REGISTER_32(DMA_BASE + 0x60)
#define DMA_CMAR5	REGISTER_32(DMA_BASE + 0x64)
#define DMA_CCR6	REGISTER_32(DMA_BASE + 0x6c)
#define DMA_CNDTR6	REGISTER_32(DMA_BASE + 0x70)
#define DMA_CPAR6	REGISTER_32(DMA_BASE + 0x74)
#define DMA_CMAR6	REGISTER_32(DMA_BASE + 0x78)
#define DMA_CCR7	REGISTER_32(DMA_BASE + 0x80)
#define DMA_CNDTR7	REGISTER_32(DMA_BASE + 0x84)
#define DMA_CPAR7	REGISTER_32(DMA_BASE + 0x88)
#define DMA_CMAR7	REGISTER_32(DMA_BASE + 0x8c)
#define DMA_CSELR	REGISTER_32(DMA_BASE + 0xa8)

// DBGMCU
#define DBG_IDCODE	REGISTER_32(DBGMCU_BASE + 0x0)
#define DBG_CR  	REGISTER_32(DBGMCU_BASE + 0x4)
#define DBG_APB1_FZ  	REGISTER_32(DBGMCU_BASE + 0x8)
#define DBG_APB2_FZ  	REGISTER_32(DBGMCU_BASE + 0xc)


// USART1

