fduignan/stm32l011_nucleo_RTC_Wakeup/stm32l011.h
#define USART1_CR1	REGISTER_32(USART1_BASE + 0)
#define USART1_CR2	REGISTER_32(USART1_BASE + 4)
#define USART1_CR3	REGISTER_32(USART1_BASE + 8)
#define USART1_BRR	REGISTER_32(USART1_BASE + 0x0c)
#define USART1_GTPR	REGISTER_32(USART1_BASE + 0x10)
#define USART1_RTOR	REGISTER_32(USART1_BASE + 0x14)
#define USART1_RQR	REGISTER_32(USART1_BASE + 0x18)
#define USART1_ISR	REGISTER_32(USART1_BASE + 0x1c)
#define USART1_ICR	REGISTER_32(USART1_BASE + 0x20)
#define USART1_RDR	REGISTER_32(USART1_BASE + 0x24)
#define USART1_TDR	REGISTER_32(USART1_BASE + 0x28)


// SPI1
#define SPI1_CR1	REGISTER_32(SPI1_BASE + 0)
#define SPI1_CR2	REGISTER_32(SPI1_BASE + 4)
#define SPI1_SR		REGISTER_32(SPI1_BASE + 8)
#define SPI1_DR		REGISTER_16(SPI1_BASE + 0x0c)
#define SPI1_DR8	REGISTER_8(SPI1_BASE + 0x0c)
#define SPI1_CRCPR	REGISTER_32(SPI1_BASE + 0x10)
#define SPI1_RXCRCR	REGISTER_32(SPI1_BASE + 0x14)
#define SPI1_TXCRCR	REGISTER_32(SPI1_BASE + 0x18)
#define SPI1_I2SCFGR	REGISTER_32(SPI1_BASE + 0x1c)
#define SPI1_I2SPR	REGISTER_32(SPI1_BASE + 0x20)


// ADC
#define ADC_ISR		REGISTER_32(ADC_BASE + 0)
#define ADC_IER		REGISTER_32(ADC_BASE + 4)
#define ADC_CR		REGISTER_32(ADC_BASE + 8)
#define ADC_CFGR1	REGISTER_32(ADC_BASE + 0x0c)
#define ADC_CFGR2	REGISTER_32(ADC_BASE + 0x10)
#define ADC_SMPR	REGISTER_32(ADC_BASE + 0x14)
#define ADC_TR		REGISTER_32(ADC_BASE + 0x20)
#define ADC_CHSELR	REGISTER_32(ADC_BASE + 0x28)
#define ADC_DR		REGISTER_32(ADC_BASE + 0x40)
#define ADC_CCR		REGISTER_32(ADC_BASE + 0x308)

// FIREWALL
#define FW_CSSA 	REGISTER_32(FIREWALL_BASE + 0x00)
#define FW_CSL  	REGISTER_32(FIREWALL_BASE + 0x04)
#define FW_NVDSSA  	REGISTER_32(FIREWALL_BASE + 0x08)
#define FW_NVDSL  	REGISTER_32(FIREWALL_BASE + 0x0c)
#define FW_VDSSA  	REGISTER_32(FIREWALL_BASE + 0x10)
#define FW_VDSL  	REGISTER_32(FIREWALL_BASE + 0x14)
#define FW_CR     	REGISTER_32(FIREWALL_BASE + 0x20)


 
// Timer 22
#define TIM22_CR1	REGISTER_32(TIM22_BASE + 0)
#define TIM22_CR2	REGISTER_32(TIM22_BASE + 4)
#define TIM22_SMCR	REGISTER_32(TIM22_BASE + 0x08)
#define TIM22_DIER	REGISTER_32(TIM22_BASE + 0x0c)
#define TIM22_SR	REGISTER_32(TIM22_BASE + 0x10)
#define TIM22_EGR	REGISTER_32(TIM22_BASE + 0x14)
#define TIM22_CCMR1	REGISTER_32(TIM22_BASE + 0x18)
#define TIM22_CCER	REGISTER_32(TIM22_BASE + 0x20)
#define TIM22_CNT	REGISTER_32(TIM22_BASE + 0x24)
#define TIM22_PSC	REGISTER_32(TIM22_BASE + 0x28)
#define TIM22_ARR	REGISTER_32(TIM22_BASE + 0x2c)
#define TIM22_CCR1	REGISTER_32(TIM22_BASE + 0x34)
#define TIM22_CCR2	REGISTER_32(TIM22_BASE + 0x38)
#define TIM22_OR	REGISTER_32(TIM22_BASE + 0x50)

 
// Timer 21
#define TIM21_CR1	REGISTER_32(TIM21_BASE + 0)
#define TIM21_CR2	REGISTER_32(TIM21_BASE + 4)
#define TIM21_SMCR	REGISTER_32(TIM21_BASE + 0x08)
#define TIM21_DIER	REGISTER_32(TIM21_BASE + 0x0c)
#define TIM21_SR	REGISTER_32(TIM21_BASE + 0x10)
#define TIM21_EGR	REGISTER_32(TIM21_BASE + 0x14)
#define TIM21_CCMR1	REGISTER_32(TIM21_BASE + 0x18)
#define TIM21_CCER	REGISTER_32(TIM21_BASE + 0x20)
#define TIM21_CNT	REGISTER_32(TIM21_BASE + 0x24)
#define TIM21_PSC	REGISTER_32(TIM21_BASE + 0x28)
#define TIM21_ARR	REGISTER_32(TIM21_BASE + 0x2c)
#define TIM21_CCR1	REGISTER_32(TIM21_BASE + 0x34)
#define TIM21_CCR2	REGISTER_32(TIM21_BASE + 0x38)
#define TIM21_OR	REGISTER_32(TIM21_BASE + 0x50)


// EXTI	
#define EXTI_IMR	REGISTER_32(EXTI_BASE + 0)
#define EXTI_EMR	REGISTER_32(EXTI_BASE + 4)
#define EXTI_RTSR	REGISTER_32(EXTI_BASE + 8)
#define EXTI_FTSR	REGISTER_32(EXTI_BASE + 0x0c)
#define EXTI_SWIER	REGISTER_32(EXTI_BASE + 0x10)
#define EXTI_PR		REGISTER_32(EXTI_BASE + 0x14)



// SYS Config
#define SYSCFG_CFGR1	REGISTER_32(SYSCFG_BASE + 0)
#define SYSCFG_CFGR2	REGISTER_32(SYSCFG_BASE + 4)
#define SYSCFG_EXTICR1	REGISTER_32(SYSCFG_BASE + 8)
#define SYSCFG_EXTICR2	REGISTER_32(SYSCFG_BASE + 0x0c)
#define SYSCFG_EXTICR3	REGISTER_32(SYSCFG_BASE + 0x10)
#define SYSCFG_EXTICR4	REGISTER_32(SYSCFG_BASE + 0x14)
#define COMP1_CTRL	REGISTER_32(SYSCFG_BASE + 0x18)
#define COMP2_CTRL	REGISTER_32(SYSCFG_BASE + 0x1c)
#define SYSCFG_CFGR3	REGISTER_32(SYSCFG_BASE + 0x20)

// LPTIM1
#define LPTIM1_ISR	REGISTER_32(SYSCFG_BASE + 0x00)
#define LPTIM1_ICR	REGISTER_32(SYSCFG_BASE + 0x04)
#define LPTIM1_IER	REGISTER_32(SYSCFG_BASE + 0x08)
#define LPTIM1_CFGR	REGISTER_32(SYSCFG_BASE + 0x0c)
#define LPTIM1_CR	REGISTER_32(SYSCFG_BASE + 0x10)
#define LPTIM1_CMP	REGISTER_32(SYSCFG_BASE + 0x14)
#define LPTIM1_ARR	REGISTER_32(SYSCFG_BASE + 0x18)
#define LPTIM1_CNT	REGISTER_32(SYSCFG_BASE + 0x1c)

// I2C3
#define I2C3_CR1	REGISTER_32(I2C3_BASE + 0)
#define I2C3_CR2	REGISTER_32(I2C3_BASE + 4)
#define I2C3_OAR1	REGISTER_32(I2C3_BASE + 8)
#define I2C3_OAR2	REGISTER_32(I2C3_BASE + 0x0c)
#define I2C3_TIMINGR	REGISTER_32(I2C3_BASE + 0x10)
#define I2C3_TIMEOUTR	REGISTER_32(I2C3_BASE + 0x14)
#define I2C3_ISR	REGISTER_32(I2C3_BASE + 0x18)
#define I2C3_ICR	REGISTER_32(I2C3_BASE + 0x1c)
#define I2C3_PECR	REGISTER_32(I2C3_BASE + 0x20)
#define I2C3_RXDR	REGISTER_8(I2C3_BASE + 0x24)
#define I2C3_TXDR	REGISTER_8(I2C3_BASE + 0x28)


// PWR 
#define PWR_CR		REGISTER_32(PWR_BASE + 0x00)
#define PWR_CSR		REGISTER_32(PWR_BASE + 0x04)

// I2C2
#define I2C2_CR1	REGISTER_32(I2C2_BASE + 0)
#define I2C2_CR2	REGISTER_32(I2C2_BASE + 4)
#define I2C2_OAR1	REGISTER_32(I2C2_BASE + 8)
#define I2C2_OAR2	REGISTER_32(I2C2_BASE + 0x0c)
#define I2C2_TIMINGR	REGISTER_32(I2C2_BASE + 0x10)
#define I2C2_TIMEOUTR	REGISTER_32(I2C2_BASE + 0x14)
#define I2C2_ISR	REGISTER_32(I2C2_BASE + 0x18)
#define I2C2_ICR	REGISTER_32(I2C2_BASE + 0x1c)
#define I2C2_PECR	REGISTER_32(I2C2_BASE + 0x20)
#define I2C2_RXDR	REGISTER_8(I2C2_BASE + 0x24)
#define I2C2_TXDR	REGISTER_8(I2C2_BASE + 0x28)

// I2C1
#define I2C1_CR1	REGISTER_32(I2C1_BASE + 0)
#define I2C1_CR2	REGISTER_32(I2C1_BASE + 4)
#define I2C1_OAR1	REGISTER_32(I2C1_BASE + 8)
#define I2C1_OAR2	REGISTER_32(I2C1_BASE + 0x0c)
#define I2C1_TIMINGR	REGISTER_32(I2C1_BASE + 0x10)
#define I2C1_TIMEOUTR	REGISTER_32(I2C1_BASE + 0x14)
#define I2C1_ISR	REGISTER_32(I2C1_BASE + 0x18)
#define I2C1_ICR	REGISTER_32(I2C1_BASE + 0x1c)
#define I2C1_PECR	REGISTER_32(I2C1_BASE + 0x20)
#define I2C1_RXDR	REGISTER_8(I2C1_BASE + 0x24)
#define I2C1_TXDR	REGISTER_8(I2C1_BASE + 0x28)


