fduignan/stm32l011_nucleo_RTC_Wakeup/stm32l011.h
// USART5

#define USART5_CR1	REGISTER_32(USART5_BASE + 0)
#define USART5_CR2	REGISTER_32(USART5_BASE + 4)
#define USART5_CR3	REGISTER_32(USART5_BASE + 8)
#define USART5_BRR	REGISTER_32(USART5_BASE + 0x0c)
#define USART5_GTPR	REGISTER_32(USART5_BASE + 0x10)
#define USART5_RTOR	REGISTER_32(USART5_BASE + 0x14)
#define USART5_RQR	REGISTER_32(USART5_BASE + 0x18)
#define USART5_ISR	REGISTER_32(USART5_BASE + 0x1c)
#define USART5_ICR	REGISTER_32(USART5_BASE + 0x20)
#define USART5_RDR	REGISTER_32(USART5_BASE + 0x24)
#define USART5_TDR	REGISTER_32(USART5_BASE + 0x28)

// USART4


#define USART4_CR1	REGISTER_32(USART4_BASE + 0)
#define USART4_CR2	REGISTER_32(USART4_BASE + 4)
#define USART4_CR3	REGISTER_32(USART4_BASE + 8)
#define USART4_BRR	REGISTER_32(USART4_BASE + 0x0c)
#define USART4_GTPR	REGISTER_32(USART4_BASE + 0x10)
#define USART4_RTOR	REGISTER_32(USART4_BASE + 0x14)
#define USART4_RQR	REGISTER_32(USART4_BASE + 0x18)
#define USART4_ISR	REGISTER_32(USART4_BASE + 0x1c)
#define USART4_ICR	REGISTER_32(USART4_BASE + 0x20)
#define USART4_RDR	REGISTER_32(USART4_BASE + 0x24)
#define USART4_TDR	REGISTER_32(USART4_BASE + 0x28)

// LPUART 
#define LPUART_CR1	REGISTER_32(LPUART_BASE + 0)
#define LPUART_CR2	REGISTER_32(LPUART_BASE + 4)
#define LPUART_CR3	REGISTER_32(LPUART_BASE + 8)
#define LPUART_BRR	REGISTER_32(LPUART_BASE + 0x0c)
#define LPUART_RQR	REGISTER_32(LPUART_BASE + 0x18)
#define LPUART_ISR	REGISTER_32(LPUART_BASE + 0x1c)
#define LPUART_ICR	REGISTER_32(LPUART_BASE + 0x20)
#define LPUART_RDR	REGISTER_32(LPUART_BASE + 0x24)
#define LPUART_TDR	REGISTER_32(LPUART_BASE + 0x28)

// USART2
#define USART2_CR1	REGISTER_32(USART2_BASE + 0)
#define USART2_CR2	REGISTER_32(USART2_BASE + 4)
#define USART2_CR3	REGISTER_32(USART2_BASE + 8)
#define USART2_BRR	REGISTER_32(USART2_BASE + 0x0c)
#define USART2_GTPR	REGISTER_32(USART2_BASE + 0x10)
#define USART2_RTOR	REGISTER_32(USART2_BASE + 0x14)
#define USART2_RQR	REGISTER_32(USART2_BASE + 0x18)
#define USART2_ISR	REGISTER_32(USART2_BASE + 0x1c)
#define USART2_ICR	REGISTER_32(USART2_BASE + 0x20)
#define USART2_RDR	REGISTER_32(USART2_BASE + 0x24)
#define USART2_TDR	REGISTER_32(USART2_BASE + 0x28)


// SPI2
#define SPI2_CR1	REGISTER_32(SPI2_BASE + 0)
#define SPI2_CR2	REGISTER_32(SPI2_BASE + 4)
#define SPI2_SR		REGISTER_32(SPI2_BASE + 8)
#define SPI2_DR		REGISTER_16(SPI2_BASE + 0x0c)
#define SPI1_DR8	REGISTER_8(SPI1_BASE + 0x0c)
#define SPI2_CRCPR	REGISTER_32(SPI2_BASE + 0x10)
#define SPI2_RXCRCR	REGISTER_32(SPI2_BASE + 0x14)
#define SPI2_TXCRCR	REGISTER_32(SPI2_BASE + 0x18)
#define SPI2_I2SCFGR	REGISTER_32(SPI2_BASE + 0x1c)
#define SPI2_I2SPR	REGISTER_32(SPI2_BASE + 0x20)


// IWDG 
#define IWDG_KR 	REGISTER_32(IWDG_BASE + 0x00)
#define IWDG_PR 	REGISTER_32(IWDG_BASE + 0x04)
#define IWDG_RLR 	REGISTER_32(IWDG_BASE + 0x08)
#define IWDG_SR 	REGISTER_32(IWDG_BASE + 0x0c)
#define IWDG_WINR 	REGISTER_32(IWDG_BASE + 0x10)

// WWDG 
#define WWDG_CR 	REGISTER_32(WWDG_BASE + 0x00)
#define WWDG_CFR 	REGISTER_32(WWDG_BASE + 0x04)
#define WWDG_SR 	REGISTER_32(WWDG_BASE + 0x08)


// RTC
#define RTC_TR		REGISTER_32(RTC_BASE + 0x00)
#define RTC_DR		REGISTER_32(RTC_BASE + 0x04)
#define RTC_CR		REGISTER_32(RTC_BASE + 0x08)
#define RTC_ISR		REGISTER_32(RTC_BASE + 0x0c)
#define RTC_PRER	REGISTER_32(RTC_BASE + 0x10)
#define RTC_WUTR	REGISTER_32(RTC_BASE + 0x14)
#define RTC_ALRMAR	REGISTER_32(RTC_BASE + 0x1c)
#define RTC_ALRMBR	REGISTER_32(RTC_BASE + 0x20)
#define RTC_WPR		REGISTER_32(RTC_BASE + 0x24)
#define RTC_SSR		REGISTER_32(RTC_BASE + 0x28)
#define RTC_SHIFTR	REGISTER_32(RTC_BASE + 0x2c)
#define RTC_TSTR	REGISTER_32(RTC_BASE + 0x30)
#define RTC_TSDR	REGISTER_32(RTC_BASE + 0x34)
#define RTC_TSSSR	REGISTER_32(RTC_BASE + 0x38)
#define RTC_CALR	REGISTER_32(RTC_BASE + 0x3c)
#define RTC_TAMPCR	REGISTER_32(RTC_BASE + 0x40)
#define RTC_ALRMASSR	REGISTER_32(RTC_BASE + 0x44)
#define RTC_ALRMBSSR	REGISTER_32(RTC_BASE + 0x48)
#define RTC_OR	        REGISTER_32(RTC_BASE + 0x4c)
#define RTC_BKP0R       REGISTER_32(RTC_BASE + 0x50)
#define RTC_BKP1R       REGISTER_32(RTC_BASE + 0x54)
#define RTC_BKP2R       REGISTER_32(RTC_BASE + 0x58)
#define RTC_BKP3R       REGISTER_32(RTC_BASE + 0x5c)
#define RTC_BKP4R       REGISTER_32(RTC_BASE + 0x60)

// TIM7 
#define TIM7_CR1	REGISTER_32(TIM7_BASE + 0)
#define TIM7_CR2	REGISTER_32(TIM7_BASE + 4)
#define TIM7_DIER	REGISTER_32(TIM7_BASE + 0x0c)
#define TIM7_SR	        REGISTER_32(TIM7_BASE + 0x10)
#define TIM7_EGR	REGISTER_32(TIM7_BASE + 0x14)
#define TIM7_CNT	REGISTER_32(TIM7_BASE + 0x24)
#define TIM7_PSC	REGISTER_32(TIM7_BASE + 0x28)
#define TIM7_ARR	REGISTER_32(TIM7_BASE + 0x2c)

// TIM6 
#define TIM6_CR1	REGISTER_32(TIM6_BASE + 0)
#define TIM6_CR2	REGISTER_32(TIM6_BASE + 4)
#define TIM6_DIER	REGISTER_32(TIM6_BASE + 0x0c)
#define TIM6_SR	        REGISTER_32(TIM6_BASE + 0x10)
#define TIM6_EGR	REGISTER_32(TIM6_BASE + 0x14)
#define TIM6_CNT	REGISTER_32(TIM6_BASE + 0x24)
#define TIM6_PSC	REGISTER_32(TIM6_BASE + 0x28)
#define TIM6_ARR	REGISTER_32(TIM6_BASE + 0x2c)



// TIM3
#define TIM3_CR1	REGISTER_16(TIM3_BASE + 0)
#define TIM3_CR2	REGISTER_16(TIM3_BASE + 4)
#define TIM3_SMCR	REGISTER_16(TIM3_BASE + 8)
#define TIM3_DIER	REGISTER_16(TIM3_BASE + 0x0c)
#define TIM3_SR		REGISTER_16(TIM3_BASE + 0x10)
#define TIM3_EGR	REGISTER_16(TIM3_BASE + 0x14)
#define TIM3_CCMR1	REGISTER_16(TIM3_BASE + 0x18)
#define TIM3_CCMR2	REGISTER_16(TIM3_BASE + 0x1c)
#define TIM3_CCER	REGISTER_16(TIM3_BASE + 0x20)
#define TIM3_CNT	REGISTER_16(TIM3_BASE + 0x24)
#define TIM3_PSC	REGISTER_16(TIM3_BASE + 0x28)
#define TIM3_ARR	REGISTER_16(TIM3_BASE + 0x2c)
#define TIM3_CCR1	REGISTER_16(TIM3_BASE + 0x34)
#define TIM3_CCR2	REGISTER_16(TIM3_BASE + 0x38)
#define TIM3_CCR3	REGISTER_16(TIM3_BASE + 0x3c)
#define TIM3_CCR4	REGISTER_16(TIM3_BASE + 0x40)
#define TIM3_DCR	REGISTER_16(TIM3_BASE + 0x48)
#define TIM3_DMAR	REGISTER_16(TIM3_BASE + 0x4c)
#define TIM3_OR	        REGISTER_16(TIM3_BASE + 0x50)


// TIM2
#define TIM2_CR1	REGISTER_16(TIM2_BASE + 0)
#define TIM2_CR2	REGISTER_16(TIM2_BASE + 4)
#define TIM2_SMCR	REGISTER_16(TIM2_BASE + 8)
#define TIM2_DIER	REGISTER_16(TIM2_BASE + 0x0c)
#define TIM2_SR		REGISTER_16(TIM2_BASE + 0x10)
#define TIM2_EGR	REGISTER_16(TIM2_BASE + 0x14)
#define TIM2_CCMR1	REGISTER_16(TIM2_BASE + 0x18)
#define TIM2_CCMR2	REGISTER_16(TIM2_BASE + 0x1c)
#define TIM2_CCER	REGISTER_16(TIM2_BASE + 0x20)
#define TIM2_CNT	REGISTER_16(TIM2_BASE + 0x24)
#define TIM2_PSC	REGISTER_16(TIM2_BASE + 0x28)
#define TIM2_ARR	REGISTER_16(TIM2_BASE + 0x2c)
#define TIM2_RCR	REGISTER_16(TIM2_BASE + 0x30)
#define TIM2_CCR1	REGISTER_16(TIM2_BASE + 0x34)
#define TIM2_CCR2	REGISTER_16(TIM2_BASE + 0x38)
#define TIM2_CCR3	REGISTER_16(TIM2_BASE + 0x3c)
#define TIM2_CCR4	REGISTER_16(TIM2_BASE + 0x40)
#define TIM2_BDTR	REGISTER_16(TIM2_BASE + 0x44)
#define TIM2_DCR	REGISTER_16(TIM2_BASE + 0x48)
#define TIM2_DMAR	REGISTER_16(TIM2_BASE + 0x4c)
#define TIM2_OR	        REGISTER_16(TIM2_BASE + 0x50)

