fduignan/stm32l011_nucleo_RTC_Wakeup/stm32l011.h
// Core peripherals
#define STK_BASE	0xe000e010
#define SCB_BASE	0xe0000000
#define NVIC_BASE 	0xe000e100

// Option bytes - see reference manual for details.

#define OPTION_WORD0	REGISTER_32( 0x1fff8000 )
#define OPTION_WORD1	REGISTER_32( 0x1fff8004 )
#define OPTION_WRPROT1_WORD0	REGISTER_32( 0x1fff8008 )
#define OPTION_WRPROT1_WORD1	REGISTER_32( 0x1fff800c )
#define OPTION_WRPROT2_WORD0	REGISTER_32( 0x1fff8010 )

// NVIC
#define ISER		REGISTER_32(NVIC_BASE + 0)
#define ICER		REGISTER_32(NVIC_BASE + 0x80)
#define ISPR		REGISTER_32(NVIC_BASE + 0x100)
#define ICPR		REGISTER_32(NVIC_BASE + 0x180)
#define IPR0		REGISTER_32(NVIC_BASE + 0x300)
#define IPR1		REGISTER_32(NVIC_BASE + 0x304)
#define IPR2		REGISTER_32(NVIC_BASE + 0x308)
#define IPR3		REGISTER_32(NVIC_BASE + 0x30c)
#define IPR4		REGISTER_32(NVIC_BASE + 0x310)
#define IPR5		REGISTER_32(NVIC_BASE + 0x314)
#define IPR6		REGISTER_32(NVIC_BASE + 0x318)
#define IPR7		REGISTER_32(NVIC_BASE + 0x31c)

// STK
#define STK_CSR		REGISTER_32(STK_BASE + 0)
#define STK_RVR		REGISTER_32(STK_BASE + 4)
#define STK_CVR		REGISTER_32(STK_BASE + 8)
#define STK_CALIB	REGISTER_32(STK_BASE + 0x0c)

// SCB
#define ACTLR		REGISTER_32(SCB_BASE + 0xe008)
#define CPUID		REGISTER_32(SCB_BASE + 0xed00)
#define ICSR		REGISTER_32(SCB_BASE + 0xed04)
#define VTOR		REGISTER_32(SCB_BASE + 0xed08)
#define AIRCR		REGISTER_32(SCB_BASE + 0xed0c)
#define SCR		REGISTER_32(SCB_BASE + 0xed10)
#define CCR		REGISTER_32(SCB_BASE + 0xed14)
#define SHPR2		REGISTER_32(SCB_BASE + 0xed1c)
#define SHPR3		REGISTER_32(SCB_BASE + 0xed20)
#define SHCSR		REGISTER_32(SCB_BASE + 0xed24)
#define DFSR		REGISTER_32(SCB_BASE + 0xed30)
